app/controllers/districts_controller.rb

  def index
    @districts = District.all
---
SELECT "districts".* FROM "districts"

  def show
    @district = District.find(params[:id])
---
SELECT  "districts".* FROM "districts" WHERE "districts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    district = District.new(params_district)
    district.save
---
INSERT INTO "districts" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Surco"], ["created_at", "2016-07-27 21:16:36.671412"], ["updated_at", "2016-07-27 21:16:36.671412"]]