app/controllers/main_controller.rb

SELECT "districts".* FROM "districts"
---
  def index
    @districts = District.all