app/controllers/parking_lots_controller.rb

  def index
    @parking_lots = ParkingLot.all
---
SELECT "parking_lots".* FROM "parking_lots"

  def new
    @parking_lot = ParkingLot.new
    @districts = District.all
---
SELECT "districts".* FROM "districts"

  def show
    @parking_lot = ParkingLot.find(params[:id])
---
SELECT  "parking_lots".* FROM "parking_lots" WHERE "parking_lots"."id" = ? LIMIT 1  [["id", 1]]

  def create
    parking_lot = ParkingLot.new(params_parking_lot)
    parking_lot.save
---
INSERT INTO "parking_lots" ("name", "description", "price", "opening_time", "closing_time", "district_id", "has_security_cameras", "has_security_alarms", "has_security_persons", "has_supermarkets_close", "has_restaurants_close", "has_cinemas_close", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)