app/controllers/rents_controller.rb

SELECT "rents".* FROM "rents"
---
  def index
    @rents = Rent.all

SELECT "parking_lots".* FROM "parking_lots"
---
  def new
    @rent = Rent.new
    @parking_lots = ParkingLot.all