app/controllers/users/sessions_controller.rb

  def new
    @parking_lots = ParkingLot.all
---
SELECT "parking_lots".* FROM "parking_lots"